Repository: clxjaguar/simple-gcode-generator
Catalog: locales/*/LC_MESSAGES/*.po
Languages: fr

source: Helicoidal
fr: Helicoïdal

source: X/Y center position
fr: Position X/Y du centre de la découpe

source: Circular movement diameter
fr: Diamètre du déplacement circulaire

source: Milling direction
fr: Sens de découpe

source: G02 (CW)
fr: G02 ↷

source: G03 (CCW)
fr: G03 ↶

source: Do a flat turn at the bottom
fr: Finition plate

source: No
fr: Non

source: Yes
fr: Oui

source: Rotative pull-out
fr: Remonter en tournant

source: Zig-zag
fr: Alterné

source: Start corner X/Y position
fr: Position X/Y du coin en début d'usinage

source: Opposite corner X/Y position
fr: Position X/Y du coin opposé

source: Mill along axis
fr: Fraiser principalement suivant axe

source: Passes horizontal wideness
fr: Largeur horizontale des passes

source: Path
fr: Trajet

source: X Y coordinates
fr: Coordonnées en X Y

source: (separated by semicolons or newlines)
fr: (séparés par des points virgules ou des retours chariot)

source: Close tool path
fr: Fermer parcours d'outil

source: Back and forth
fr: Vas-et-viens

source: Incorrect amount of coordinates:
fr: Trop ou pas assez de coordonnées :

source: Missing condition
fr: Erreur programme : condition manquante

source: Drilling
fr: Perçages

source: X Y or X Y Z coordinates
fr: Coordonnées des perçages en X Y ou X Y Z

source: Setback height from surface
fr: Hauteur de retrait par rapport à la surface

source: About
fr: À propos

source: Programmed by
fr: Programmé par

source: Parent process: %s
fr: Process parent : %s

source: Z workpiece surface
fr: Z de surface de pièce

source: Z at job end
fr: Z en fin de fraisage

source: Z decrement (height of passes)
fr: Décrément en Z (épaisseur des passes)

source: Plunging rate
fr: Vitesse de descente

source: Feed rate
fr: Vitesse d'avance

source: Trajectory mode
fr: Mode de trajectoire

source: Exact
fr: Exacte

source: Speed
fr: Vitesse

source: Stops
fr: Arrêts

source: (to file)
fr: (vers fichier)

source: Generate G-Code
fr: Générer G-Code

source: (update file)
fr: (mise à jour fichier)

source: (to standard output)
fr: (vers sortie standard)

source: G-Code Generator
fr: Générateur de G-Code

source: Export G-Code as...
fr: Export G-Code sous...

source: All files
fr: Tous les fichiers

source: G-Code files
fr: Fichiers G-Code

source: Exception at line %d
fr: Exception en ligne %d

source: G-Code generation error
fr: Erreur génération G-Code
